Tekla Open API Reference for Tekla Structures 2025
UserPropertyItem.Visibility Property
 Indicates whether the property value is visible/editable.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public UserPropertyVisibilityEnum Visibility { get; set; }
Public Property Visibility As UserPropertyVisibilityEnum
	Get
	Set
Property Value
Type: UserPropertyVisibilityEnum
See Also
Reference
UserPropertyItem Class
Tekla.Structures.Catalogs Namespace